demo.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>System Demonstration</title>
<!-- 2018-05-09 Wed 13:56 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Gabriel" />
</head>
<body>
<div id="content">
<h1 class="title">System Demonstration</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Documentation</a></li>
<li><a href="#sec-2">2. Getting help with <code>--help</code></a></li>
<li><a href="#sec-3">3. Create users</a></li>
<li><a href="#sec-4">4. Create class</a></li>
<li><a href="#sec-5">5. Add student repos to class</a></li>
<li><a href="#sec-6">6. Create group project</a></li>
<li><a href="#sec-7">7. Clone a project</a></li>
<li><a href="#sec-8">8. Batch processing</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Documentation</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="https://github.com/GabrielDougherty/edinboro-gitlab-assignment/blob/docs/docs/quickstart.md">Quick Start Guide</a>
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Getting help with <code>--help</code></h2>
<div class="outline-text-2" id="text-2">
<p>
<code>./create-users.py --help</code>
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Create users</h2>
<div class="outline-text-2" id="text-3">
<p>
<code>./create-users.py --file-name csci408.csv --course-number 408 --course-section 1</code>
</p>

<p>
Creates users from a student roster file, filtered by class
</p>

<p>
<a href="http://codestore.cs.edinboro.edu/admin/users">List of users</a>
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Create class</h2>
<div class="outline-text-2" id="text-4">
<p>
<code>./create-class.py --course-name csci411 --course-section 1</code>
</p>

<p>
<a href="http://codestore.cs.edinboro.edu/csci-411-1">Class page</a>
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Add student repos to class</h2>
<div class="outline-text-2" id="text-5">
<p>
<code>./create-repos.py --token-file test_token --classlist students-csci408.txt --add-students csci-411-1</code>
</p>

<p>
This creates the student repos and adds the student accounts to them
</p>

<p>
<a href="http://codestore.cs.edinboro.edu/csci-411-1">Class page</a>
</p>
</div>
</div>


<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Create group project</h2>
<div class="outline-text-2" id="text-6">
<p>
<code>./create-group-project.py --group-name csci-411-1 --file-name group-students-csci411.txt --project-name project-1</code>
</p>

<p>
<a href="http://codestore.cs.edinboro.edu/csci-411-1">Class page</a>
</p>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Clone a project</h2>
<div class="outline-text-2" id="text-7">
<p>
<code>./clone.py --revert-date "2018-05-30 15:10" --token-file test_token csci-411-1</code>
</p>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Batch processing</h2>
<div class="outline-text-2" id="text-8">
<p>
<code>./batch-operation.py gabriel-class "ls -1a"​</code>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Gabriel</p>
<p class="date">Created: 2018-05-09 Wed 13:56</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.2.2 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
